Revit 2024 API
MechanicalEquipmentSet.Classification Property
 The classification for the mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public EquipmentClassification Classification { get; }
Visual Basic
Public ReadOnly Property Classification As EquipmentClassification
	Get
Visual C++
public:
property EquipmentClassification Classification {
	EquipmentClassification get ();
}
See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace